tutorials/melting/convection/referenceSolution_Temperature/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 504.49;

boundaryField
{    
    north
    {
        type            zeroGradient;
        //type            fixedValue;
        //value           uniform 293;
    }

    ovest
    {
        type            fixedValue;
        value           uniform 508;
        //type            zeroGradient;
    }

    east
    {
        type            fixedValue;
        value           uniform 504.49;
        //type            zeroGradient;
    }

    south
    {
        type            zeroGradient;
        //type            fixedValue;
        //value           uniform 260;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
