tutorials/melting/convection/referenceSolution_Temperature/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 4e-06;

boundaryField
{
    north
    {
        type            epsilonWallFunction;
        value           uniform 4e-06;
    }
    ovest
    {
        type            epsilonWallFunction;
        value           uniform 4e-06;
    }
    east
    {
        type            epsilonWallFunction;
        value           uniform 4e-06;
    }
    south
    {
        type            epsilonWallFunction;
        value           uniform 4e-06;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
