tutorials/melting/convection/referenceSolution_Temperature/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    north
    {
	type		fixedFluxPressure;
	rho		rhok;
	value		uniform 0;
    }

    ovest
    {
	type		fixedFluxPressure;
	rho		rhok;
	value		uniform 0;
    }

    east
    {
	type		fixedFluxPressure;
	rho		rhok;
	value		uniform 0;
    }

    south
    {
	type		fixedFluxPressure;
	rho		rhok;
	value		uniform 0;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
