tutorials/melting/convection/referenceSolution_Temperature/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver          GAMG;
        tolerance       1e-8;
        relTol          0.01;

        smoother         DICGaussSeidel;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    p
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-8;
        relTol          0.01;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    T_star
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.1;
    }

    T_starFinal
    {
        $T_star;
        relTol          0;
    }

    "(U|T|h|k|epsilon|omega)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.1;
    }

    "(U|T|h|k|epsilon|omega)Final"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.1;
    }
}

SIMPLE
{
    momentumPredictor yes;
    nNonOrthogonalCorrectors 2;
    nCorrectors	    2;
    pRefCell        0;
    pRefValue       0;

    residualControl
    {
        p_rgh           1e-4;
        U               1e-4;
        T               1e-4;

        // possibly check turbulence fields
        "(k|epsilon|omega)" 1e-3;
    }
}

/*
relaxationFactors
{
    fields
    {
        T               0.99;
        U               0.7;
        p_rgh           0.3;
        p               0.3;
    }

    equations
    {
        U               0.3;
        h               0.3;
        "(k|epsilon|omega)" 0.7;
    }
}
*/


TPIMPLE
{
    nOuterCorrectors    500;

    outerCorrectorResidualControl
    {
        T_star
        {
            relTol          1e-5;
            tolerance       1e-5;
        }
        h
        {
            relTol          1e-8;
            tolerance       1e-8;
        }
    }

}

PIMPLE
{
    momentumPredictor   yes;
    //nOuterCorrectors    30;
    nCorrectors         2;
    nNonOrthogonalCorrectors 0;
    consistent yes;
    //turbOnFinalIterOnly no;

    pRefCell        0;
    pRefValue       0;

    outerCorrectorResidualControl
    {
        "p_rgh.*"
        {
            relTol          1e-5;
            tolerance       1e-5;
        }
      "(U|k|epsilon)"
        {
            relTol          1e-5;
            tolerance       1e-5;
        }

    }

}
/*        T
        {
            relTol          1e-4;
            tolerance       1e-4;
        }
        f
        {
            relTol          1e-4;
            tolerance       1e-4;
        }
*/




// ************************************************************************* //
